package com.example.qroc.util;

public class TextMessage {
    public static final String USER_NEED_READ = "【Qroc 用户协议】\n" +
            "\n" +
            "欢迎使用 Qroc 应用程序。通过使用 Qroc，您同意遵守以下条款和条件。\n" +
            "\n" +
            "【服务使用】\n" +
            "\n" +
            "1.1 您同意使用 Qroc 仅用于合法目的，并遵守所有适用的法律和法规。\n" +
            "\n" +
            "1.2 您同意不会利用 Qroc 进行任何违法、欺诈或滥用行为。\n" +
            "\n" +
            "【知识产权】\n" +
            "\n" +
            "2.1 Qroc 应用程序及其原始内容（包括但不限于文字、图形、图像等）的所有权归 Qroc 或其许可方所有。\n" +
            "\n" +
            "2.2 您同意不得以任何形式复制、修改、传播或利用 Qroc 应用程序的任何部分。\n" +
            "\n" +
            "【免责声明】\n" +
            "\n" +
            "3.1 Qroc 将尽合理努力保证服务的稳定性和安全性，但不对由于不可抗力、第三方行为或其他不可控因素导致的服务中断或数据丢失负责。\n" +
            "\n" +
            "3.2 您理解并同意使用 Qroc 服务的风险由您个人承担。\n" +
            "\n" +
            "【终止】\n" +
            "\n" +
            "4.1 Qroc 保留根据自身判断，随时终止或暂停向您提供服务的权利。\n" +
            "\n" +
            "4.2 您可以随时停止使用 Qroc。\n" +
            "\n" +
            "【Qroc 隐私政策】\n" +
            "\n" +
            "Qroc 尊重并保护用户的隐私。本隐私政策解释了 Qroc 收集、使用和保护您的个人信息的方式。\n" +
            "\n" +
            "【信息收集】\n" +
            "\n" +
            "1.1 Qroc 可能会收集您的个人信息，包括但不限于姓名、电子邮件地址、联系方式等，用于提供服务和支持。\n" +
            "\n" +
            "1.2 Qroc 可能会自动收集有关您的设备和使用方式的信息，包括但不限于设备型号、操作系统版本等。\n" +
            "\n" +
            "【信息使用】\n" +
            "\n" +
            "2.1 Qroc 仅会在提供服务和支持的范围内使用您的个人信息。\n" +
            "\n" +
            "2.2 Qroc 不会向第三方出售或出租您的个人信息。\n" +
            "\n" +
            "【信息保护】\n" +
            "\n" +
            "3.1 Qroc 将采取合理的安全措施保护您的个人信息，防止未经授权的访问、使用或泄露。\n" +
            "\n" +
            "3.2 您理解并同意在互联网环境下，无法保证信息的绝对安全。\n" +
            "\n" +
            "【信息披露】\n" +
            "\n" +
            "4.1 Qroc 可能会在法律要求或保护 Qroc 或他人权利的情况下披露您的个人信息。\n" +
            "\n" +
            "4.2 在不透露个人身份的情况下，Qroc 可能会使用汇总的信息进行统计分析或其他合法用途。";
    public static final String CONNECT_ERROR_MESSAGE = "连接超时，请检查网络连接!";
}
